In [10]:
import pandas as pd

In [11]:
data = {
    'Name':['Jhon', 'David', 'Ryan'],
    'Maths':[87,93,90],
    'Chemistry':[83,78,81],
    'Physics':[92,80,79]
}
df = pd.DataFrame(data)
df

    Name  Maths  Chemistry  Physics
0   Jhon     87         83       92
1  David     93         78       80
2   Ryan     90         81       79

# Melt

In [12]:
melted_df = df.melt(id_vars=['Name'], value_vars=['Maths', 'Chemistry', 'Physics'], value_name='Score', var_name='Subjects')
melted_df

    Name   Subjects  Score
0   Jhon      Maths     87
1  David      Maths     93
2   Ryan      Maths     90
3   Jhon  Chemistry     83
4  David  Chemistry     78
5   Ryan  Chemistry     81
6   Jhon    Physics     92
7  David    Physics     80
8   Ryan    Physics     79

# Pivot

In [13]:
pivoted_df = melted_df.pivot(index='Name', columns='Subjects', values='Score')
pivoted_df

Subjects  Chemistry  Maths  Physics
Name
David            78     93       80
Jhon             83     87       92
Ryan             81     90       79

There is also a pivot table this is when we have duplicate values in the dataframe so df.pivot() throw error in that case we use df.pivot_table() which solve this problem find out in Handbook